Groupby - allows you to group together rows based off of a column and perform an aggregate function on them.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company': ['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'], 'Person': ['John', 'Smith', 'Jane', 'Doe', 'Charlie', 'Keith'], 'Sales': [200, 120, 340, 124, 243, 350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     Company   Person  Sales
0     Google     John    200
1     Google    Smith    120
2  Microsoft     Jane    340
3  Microsoft      Doe    124
4   Facebook  Charlie    243
5   Facebook    Keith    350

In [6]:
by_company = df.groupby('Company')

In [8]:
by_company.mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [9]:
by_company.sum()

           Sales
Company
Facebook     593
Google       320
Microsoft    464

In [10]:
by_company.std()

                Sales
Company
Facebook    75.660426
Google      56.568542
Microsoft  152.735065

In [12]:
by_company.sum().loc['Facebook']

Sales    593
Name: Facebook, dtype: int64

In [14]:
df.groupby('Company').max()

          Person  Sales
Company
Facebook   Keith    350
Google     Smith    200
Microsoft   Jane    340

In [18]:
df.groupby('Company').describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000